python_help_dict = {
    "number": "Числа - целые (int) и с плавающей точкой (float). Примеры: x = 5, y = 3.14",
    "str": "Строки - неизменяемые последовательности символов. Пример: my_string = 'Привет, мир!'",
    "list": "Списки - упорядоченные измняемые коллекции. Пример: my_list = [1, 2, 3]",
    "dict": "Словари - неупорядоченные коллекции пар ключ-значение c быстрым поиском по ключу. Пример: my_dict = "
            "{'ключ': 'значение', 'дерево': 'яблоко'}",
    "tuple": "Кортежи - неизменяемые упорядоченные коллекции. Пример: my_tuple =(1,2,3)",
    "set": "Множества - неупорядоченные коллекции уникальных элементов с быстрым поиском. Пример: my_set = {1, 2, 3}",
    "if": "Условный оператор. Пример: "
          "\nif x > 0: "
          "\n    print('Положительное')",
    "for": "Цикл для итерации. Пример: "
          "\nfor i in range(5): "
          "\n    print(i)",
    "while": "Цикл с предусловием. Пример: "
            "\nwhile x > 0: "
            "\n    x -= 1",
    "function": "Функции определяются с помощью def. Пример: "
                "\ndef greet(name): "
                "\n    print(f'Привет, {name}!')",
    "class": "Классы - основа ООП в Python. Пример: "
            "\nclass Dog: "
            "\n    def hello(self): "
            "\n        print('Привет!')",
    "f-string": "f-строки - способ форматирования строк. Пример: name = 'Мир'; print(f'Привет, {name}!')",
    "range": "Функция range используется для создания последовательностей чисел. "
            "Пример: range(3) создает последовательность [0, 1, 2]"
}

PROMPT_LM = f"System: Reply as a helpful assistant for learning Python."

